zhengwang721/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20g17a.h
#define PIN_PA00C_SERCOM0_PAD2             0  /**< \brief SERCOM0 signal: PAD2 on PA00 mux C */
#define MUX_PA00C_SERCOM0_PAD2             2
#define PINMUX_PA00C_SERCOM0_PAD2  ((PIN_PA00C_SERCOM0_PAD2 << 16) | MUX_PA00C_SERCOM0_PAD2)
#define PORT_PA00C_SERCOM0_PAD2    (1u <<  0)
#define PIN_PA08B_SERCOM0_PAD2             8  /**< \brief SERCOM0 signal: PAD2 on PA08 mux B */
#define MUX_PA08B_SERCOM0_PAD2             1
#define PINMUX_PA08B_SERCOM0_PAD2  ((PIN_PA08B_SERCOM0_PAD2 << 16) | MUX_PA08B_SERCOM0_PAD2)
#define PORT_PA08B_SERCOM0_PAD2    (1u <<  8)
#define PIN_PA01C_SERCOM0_PAD3             1  /**< \brief SERCOM0 signal: PAD3 on PA01 mux C */
#define MUX_PA01C_SERCOM0_PAD3             2
#define PINMUX_PA01C_SERCOM0_PAD3  ((PIN_PA01C_SERCOM0_PAD3 << 16) | MUX_PA01C_SERCOM0_PAD3)
#define PORT_PA01C_SERCOM0_PAD3    (1u <<  1)
#define PIN_PA09B_SERCOM0_PAD3             9  /**< \brief SERCOM0 signal: PAD3 on PA09 mux B */
#define MUX_PA09B_SERCOM0_PAD3             1
#define PINMUX_PA09B_SERCOM0_PAD3  ((PIN_PA09B_SERCOM0_PAD3 << 16) | MUX_PA09B_SERCOM0_PAD3)
#define PORT_PA09B_SERCOM0_PAD3    (1u <<  9)
/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PA30C_SERCOM1_PAD0            30  /**< \brief SERCOM1 signal: PAD0 on PA30 mux C */
#define MUX_PA30C_SERCOM1_PAD0             2
#define PINMUX_PA30C_SERCOM1_PAD0  ((PIN_PA30C_SERCOM1_PAD0 << 16) | MUX_PA30C_SERCOM1_PAD0)
#define PORT_PA30C_SERCOM1_PAD0    (1u << 30)
#define PIN_PA18B_SERCOM1_PAD0            18  /**< \brief SERCOM1 signal: PAD0 on PA18 mux B */
#define MUX_PA18B_SERCOM1_PAD0             1
#define PINMUX_PA18B_SERCOM1_PAD0  ((PIN_PA18B_SERCOM1_PAD0 << 16) | MUX_PA18B_SERCOM1_PAD0)
#define PORT_PA18B_SERCOM1_PAD0    (1u << 18)
#define PIN_PA31C_SERCOM1_PAD1            31  /**< \brief SERCOM1 signal: PAD1 on PA31 mux C */
#define MUX_PA31C_SERCOM1_PAD1             2
#define PINMUX_PA31C_SERCOM1_PAD1  ((PIN_PA31C_SERCOM1_PAD1 << 16) | MUX_PA31C_SERCOM1_PAD1)
#define PORT_PA31C_SERCOM1_PAD1    (1u << 31)
#define PIN_PA19B_SERCOM1_PAD1            19  /**< \brief SERCOM1 signal: PAD1 on PA19 mux B */
#define MUX_PA19B_SERCOM1_PAD1             1
#define PINMUX_PA19B_SERCOM1_PAD1  ((PIN_PA19B_SERCOM1_PAD1 << 16) | MUX_PA19B_SERCOM1_PAD1)
#define PORT_PA19B_SERCOM1_PAD1    (1u << 19)
#define PIN_PA04C_SERCOM1_PAD2             4  /**< \brief SERCOM1 signal: PAD2 on PA04 mux C */
#define MUX_PA04C_SERCOM1_PAD2             2
#define PINMUX_PA04C_SERCOM1_PAD2  ((PIN_PA04C_SERCOM1_PAD2 << 16) | MUX_PA04C_SERCOM1_PAD2)
#define PORT_PA04C_SERCOM1_PAD2    (1u <<  4)
#define PIN_PA16B_SERCOM1_PAD2            16  /**< \brief SERCOM1 signal: PAD2 on PA16 mux B */
#define MUX_PA16B_SERCOM1_PAD2             1
#define PINMUX_PA16B_SERCOM1_PAD2  ((PIN_PA16B_SERCOM1_PAD2 << 16) | MUX_PA16B_SERCOM1_PAD2)
#define PORT_PA16B_SERCOM1_PAD2    (1u << 16)
#define PIN_PA05C_SERCOM1_PAD3             5  /**< \brief SERCOM1 signal: PAD3 on PA05 mux C */
#define MUX_PA05C_SERCOM1_PAD3             2
#define PINMUX_PA05C_SERCOM1_PAD3  ((PIN_PA05C_SERCOM1_PAD3 << 16) | MUX_PA05C_SERCOM1_PAD3)
#define PORT_PA05C_SERCOM1_PAD3    (1u <<  5)
#define PIN_PA17B_SERCOM1_PAD3            17  /**< \brief SERCOM1 signal: PAD3 on PA17 mux B */
#define MUX_PA17B_SERCOM1_PAD3             1
#define PINMUX_PA17B_SERCOM1_PAD3  ((PIN_PA17B_SERCOM1_PAD3 << 16) | MUX_PA17B_SERCOM1_PAD3)
#define PORT_PA17B_SERCOM1_PAD3    (1u << 17)
/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PA10C_SERCOM2_PAD0            10  /**< \brief SERCOM2 signal: PAD0 on PA10 mux C */
#define MUX_PA10C_SERCOM2_PAD0             2
#define PINMUX_PA10C_SERCOM2_PAD0  ((PIN_PA10C_SERCOM2_PAD0 << 16) | MUX_PA10C_SERCOM2_PAD0)
#define PORT_PA10C_SERCOM2_PAD0    (1u << 10)
#define PIN_PA14B_SERCOM2_PAD0            14  /**< \brief SERCOM2 signal: PAD0 on PA14 mux B */
#define MUX_PA14B_SERCOM2_PAD0             1
#define PINMUX_PA14B_SERCOM2_PAD0  ((PIN_PA14B_SERCOM2_PAD0 << 16) | MUX_PA14B_SERCOM2_PAD0)
#define PORT_PA14B_SERCOM2_PAD0    (1u << 14)
#define PIN_PA11C_SERCOM2_PAD1            11  /**< \brief SERCOM2 signal: PAD1 on PA11 mux C */
#define MUX_PA11C_SERCOM2_PAD1             2
#define PINMUX_PA11C_SERCOM2_PAD1  ((PIN_PA11C_SERCOM2_PAD1 << 16) | MUX_PA11C_SERCOM2_PAD1)
#define PORT_PA11C_SERCOM2_PAD1    (1u << 11)
#define PIN_PA15B_SERCOM2_PAD1            15  /**< \brief SERCOM2 signal: PAD1 on PA15 mux B */
#define MUX_PA15B_SERCOM2_PAD1             1
#define PINMUX_PA15B_SERCOM2_PAD1  ((PIN_PA15B_SERCOM2_PAD1 << 16) | MUX_PA15B_SERCOM2_PAD1)
#define PORT_PA15B_SERCOM2_PAD1    (1u << 15)
#define PIN_PA08C_SERCOM2_PAD2             8  /**< \brief SERCOM2 signal: PAD2 on PA08 mux C */
#define MUX_PA08C_SERCOM2_PAD2             2
#define PINMUX_PA08C_SERCOM2_PAD2  ((PIN_PA08C_SERCOM2_PAD2 << 16) | MUX_PA08C_SERCOM2_PAD2)
#define PORT_PA08C_SERCOM2_PAD2    (1u <<  8)
#define PIN_PA12B_SERCOM2_PAD2            12  /**< \brief SERCOM2 signal: PAD2 on PA12 mux B */
#define MUX_PA12B_SERCOM2_PAD2             1
#define PINMUX_PA12B_SERCOM2_PAD2  ((PIN_PA12B_SERCOM2_PAD2 << 16) | MUX_PA12B_SERCOM2_PAD2)
#define PORT_PA12B_SERCOM2_PAD2    (1u << 12)
#define PIN_PA09C_SERCOM2_PAD3             9  /**< \brief SERCOM2 signal: PAD3 on PA09 mux C */
#define MUX_PA09C_SERCOM2_PAD3             2
#define PINMUX_PA09C_SERCOM2_PAD3  ((PIN_PA09C_SERCOM2_PAD3 << 16) | MUX_PA09C_SERCOM2_PAD3)
#define PORT_PA09C_SERCOM2_PAD3    (1u <<  9)
#define PIN_PA13B_SERCOM2_PAD3            13  /**< \brief SERCOM2 signal: PAD3 on PA13 mux B */
#define MUX_PA13B_SERCOM2_PAD3             1
#define PINMUX_PA13B_SERCOM2_PAD3  ((PIN_PA13B_SERCOM2_PAD3 << 16) | MUX_PA13B_SERCOM2_PAD3)
#define PORT_PA13B_SERCOM2_PAD3    (1u << 13)
/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PA18C_SERCOM3_PAD0            18  /**< \brief SERCOM3 signal: PAD0 on PA18 mux C */
#define MUX_PA18C_SERCOM3_PAD0             2
#define PINMUX_PA18C_SERCOM3_PAD0  ((PIN_PA18C_SERCOM3_PAD0 << 16) | MUX_PA18C_SERCOM3_PAD0)
#define PORT_PA18C_SERCOM3_PAD0    (1u << 18)
#define PIN_PA24B_SERCOM3_PAD0            24  /**< \brief SERCOM3 signal: PAD0 on PA24 mux B */
#define MUX_PA24B_SERCOM3_PAD0             1
#define PINMUX_PA24B_SERCOM3_PAD0  ((PIN_PA24B_SERCOM3_PAD0 << 16) | MUX_PA24B_SERCOM3_PAD0)
#define PORT_PA24B_SERCOM3_PAD0    (1u << 24)
#define PIN_PA19C_SERCOM3_PAD1            19  /**< \brief SERCOM3 signal: PAD1 on PA19 mux C */
#define MUX_PA19C_SERCOM3_PAD1             2
#define PINMUX_PA19C_SERCOM3_PAD1  ((PIN_PA19C_SERCOM3_PAD1 << 16) | MUX_PA19C_SERCOM3_PAD1)
#define PORT_PA19C_SERCOM3_PAD1    (1u << 19)
#define PIN_PA25B_SERCOM3_PAD1            25  /**< \brief SERCOM3 signal: PAD1 on PA25 mux B */
#define MUX_PA25B_SERCOM3_PAD1             1
#define PINMUX_PA25B_SERCOM3_PAD1  ((PIN_PA25B_SERCOM3_PAD1 << 16) | MUX_PA25B_SERCOM3_PAD1)
#define PORT_PA25B_SERCOM3_PAD1    (1u << 25)
#define PIN_PA16C_SERCOM3_PAD2            16  /**< \brief SERCOM3 signal: PAD2 on PA16 mux C */
#define MUX_PA16C_SERCOM3_PAD2             2
#define PINMUX_PA16C_SERCOM3_PAD2  ((PIN_PA16C_SERCOM3_PAD2 << 16) | MUX_PA16C_SERCOM3_PAD2)
#define PORT_PA16C_SERCOM3_PAD2    (1u << 16)
#define PIN_PA26B_SERCOM3_PAD2            26  /**< \brief SERCOM3 signal: PAD2 on PA26 mux B */
#define MUX_PA26B_SERCOM3_PAD2             1
#define PINMUX_PA26B_SERCOM3_PAD2  ((PIN_PA26B_SERCOM3_PAD2 << 16) | MUX_PA26B_SERCOM3_PAD2)
#define PORT_PA26B_SERCOM3_PAD2    (1u << 26)
#define PIN_PA17C_SERCOM3_PAD3            17  /**< \brief SERCOM3 signal: PAD3 on PA17 mux C */
#define MUX_PA17C_SERCOM3_PAD3             2
#define PINMUX_PA17C_SERCOM3_PAD3  ((PIN_PA17C_SERCOM3_PAD3 << 16) | MUX_PA17C_SERCOM3_PAD3)
#define PORT_PA17C_SERCOM3_PAD3    (1u << 17)
#define PIN_PA27B_SERCOM3_PAD3            27  /**< \brief SERCOM3 signal: PAD3 on PA27 mux B */
#define MUX_PA27B_SERCOM3_PAD3             1
#define PINMUX_PA27B_SERCOM3_PAD3  ((PIN_PA27B_SERCOM3_PAD3 << 16) | MUX_PA27B_SERCOM3_PAD3)
#define PORT_PA27B_SERCOM3_PAD3    (1u << 27)
/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PA14C_SERCOM4_PAD0            14  /**< \brief SERCOM4 signal: PAD0 on PA14 mux C */
#define MUX_PA14C_SERCOM4_PAD0             2
#define PINMUX_PA14C_SERCOM4_PAD0  ((PIN_PA14C_SERCOM4_PAD0 << 16) | MUX_PA14C_SERCOM4_PAD0)
#define PORT_PA14C_SERCOM4_PAD0    (1u << 14)
#define PIN_PB00C_SERCOM4_PAD0            32  /**< \brief SERCOM4 signal: PAD0 on PB00 mux C */
#define MUX_PB00C_SERCOM4_PAD0             2
#define PINMUX_PB00C_SERCOM4_PAD0  ((PIN_PB00C_SERCOM4_PAD0 << 16) | MUX_PB00C_SERCOM4_PAD0)
#define PORT_PB00C_SERCOM4_PAD0    (1u <<  0)
#define PIN_PB08B_SERCOM4_PAD0            40  /**< \brief SERCOM4 signal: PAD0 on PB08 mux B */
#define MUX_PB08B_SERCOM4_PAD0             1
#define PINMUX_PB08B_SERCOM4_PAD0  ((PIN_PB08B_SERCOM4_PAD0 << 16) | MUX_PB08B_SERCOM4_PAD0)
#define PORT_PB08B_SERCOM4_PAD0    (1u <<  8)
#define PIN_PA15C_SERCOM4_PAD1            15  /**< \brief SERCOM4 signal: PAD1 on PA15 mux C */
#define MUX_PA15C_SERCOM4_PAD1             2
#define PINMUX_PA15C_SERCOM4_PAD1  ((PIN_PA15C_SERCOM4_PAD1 << 16) | MUX_PA15C_SERCOM4_PAD1)
#define PORT_PA15C_SERCOM4_PAD1    (1u << 15)
#define PIN_PB01C_SERCOM4_PAD1            33  /**< \brief SERCOM4 signal: PAD1 on PB01 mux C */
#define MUX_PB01C_SERCOM4_PAD1             2
#define PINMUX_PB01C_SERCOM4_PAD1  ((PIN_PB01C_SERCOM4_PAD1 << 16) | MUX_PB01C_SERCOM4_PAD1)
#define PORT_PB01C_SERCOM4_PAD1    (1u <<  1)
#define PIN_PB09B_SERCOM4_PAD1            41  /**< \brief SERCOM4 signal: PAD1 on PB09 mux B */
#define MUX_PB09B_SERCOM4_PAD1             1
#define PINMUX_PB09B_SERCOM4_PAD1  ((PIN_PB09B_SERCOM4_PAD1 << 16) | MUX_PB09B_SERCOM4_PAD1)
#define PORT_PB09B_SERCOM4_PAD1    (1u <<  9)
#define PIN_PB02C_SERCOM4_PAD2            34  /**< \brief SERCOM4 signal: PAD2 on PB02 mux C */
#define MUX_PB02C_SERCOM4_PAD2             2
#define PINMUX_PB02C_SERCOM4_PAD2  ((PIN_PB02C_SERCOM4_PAD2 << 16) | MUX_PB02C_SERCOM4_PAD2)
#define PORT_PB02C_SERCOM4_PAD2    (1u <<  2)
#define PIN_PA12C_SERCOM4_PAD2            12  /**< \brief SERCOM4 signal: PAD2 on PA12 mux C */
#define MUX_PA12C_SERCOM4_PAD2             2
#define PINMUX_PA12C_SERCOM4_PAD2  ((PIN_PA12C_SERCOM4_PAD2 << 16) | MUX_PA12C_SERCOM4_PAD2)
#define PORT_PA12C_SERCOM4_PAD2    (1u << 12)
#define PIN_PA13C_SERCOM4_PAD3            13  /**< \brief SERCOM4 signal: PAD3 on PA13 mux C */
#define MUX_PA13C_SERCOM4_PAD3             2
#define PINMUX_PA13C_SERCOM4_PAD3  ((PIN_PA13C_SERCOM4_PAD3 << 16) | MUX_PA13C_SERCOM4_PAD3)
#define PORT_PA13C_SERCOM4_PAD3    (1u << 13)
#define PIN_PB03C_SERCOM4_PAD3            35  /**< \brief SERCOM4 signal: PAD3 on PB03 mux C */
#define MUX_PB03C_SERCOM4_PAD3             2
#define PINMUX_PB03C_SERCOM4_PAD3  ((PIN_PB03C_SERCOM4_PAD3 << 16) | MUX_PB03C_SERCOM4_PAD3)
#define PORT_PB03C_SERCOM4_PAD3    (1u <<  3)
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PA24C_SERCOM5_PAD0            24  /**< \brief SERCOM5 signal: PAD0 on PA24 mux C */
#define MUX_PA24C_SERCOM5_PAD0             2
#define PINMUX_PA24C_SERCOM5_PAD0  ((PIN_PA24C_SERCOM5_PAD0 << 16) | MUX_PA24C_SERCOM5_PAD0)
#define PORT_PA24C_SERCOM5_PAD0    (1u << 24)
#define PIN_PB20B_SERCOM5_PAD0            52  /**< \brief SERCOM5 signal: PAD0 on PB20 mux B */
#define MUX_PB20B_SERCOM5_PAD0             1
#define PINMUX_PB20B_SERCOM5_PAD0  ((PIN_PB20B_SERCOM5_PAD0 << 16) | MUX_PB20B_SERCOM5_PAD0)
#define PORT_PB20B_SERCOM5_PAD0    (1u << 20)
#define PIN_PA25C_SERCOM5_PAD1            25  /**< \brief SERCOM5 signal: PAD1 on PA25 mux C */
#define MUX_PA25C_SERCOM5_PAD1             2
#define PINMUX_PA25C_SERCOM5_PAD1  ((PIN_PA25C_SERCOM5_PAD1 << 16) | MUX_PA25C_SERCOM5_PAD1)
#define PORT_PA25C_SERCOM5_PAD1    (1u << 25)
#define PIN_PB21B_SERCOM5_PAD1            53  /**< \brief SERCOM5 signal: PAD1 on PB21 mux B */
#define MUX_PB21B_SERCOM5_PAD1             1
#define PINMUX_PB21B_SERCOM5_PAD1  ((PIN_PB21B_SERCOM5_PAD1 << 16) | MUX_PB21B_SERCOM5_PAD1)
#define PORT_PB21B_SERCOM5_PAD1    (1u << 21)
#define PIN_PA26C_SERCOM5_PAD2            26  /**< \brief SERCOM5 signal: PAD2 on PA26 mux C */
#define MUX_PA26C_SERCOM5_PAD2             2
#define PINMUX_PA26C_SERCOM5_PAD2  ((PIN_PA26C_SERCOM5_PAD2 << 16) | MUX_PA26C_SERCOM5_PAD2)
#define PORT_PA26C_SERCOM5_PAD2    (1u << 26)
#define PIN_PB22B_SERCOM5_PAD2            54  /**< \brief SERCOM5 signal: PAD2 on PB22 mux B */
#define MUX_PB22B_SERCOM5_PAD2             1
#define PINMUX_PB22B_SERCOM5_PAD2  ((PIN_PB22B_SERCOM5_PAD2 << 16) | MUX_PB22B_SERCOM5_PAD2)
#define PORT_PB22B_SERCOM5_PAD2    (1u << 22)
#define PIN_PA27C_SERCOM5_PAD3            27  /**< \brief SERCOM5 signal: PAD3 on PA27 mux C */
#define MUX_PA27C_SERCOM5_PAD3             2
#define PINMUX_PA27C_SERCOM5_PAD3  ((PIN_PA27C_SERCOM5_PAD3 << 16) | MUX_PA27C_SERCOM5_PAD3)
#define PORT_PA27C_SERCOM5_PAD3    (1u << 27)
#define PIN_PB23B_SERCOM5_PAD3            55  /**< \brief SERCOM5 signal: PAD3 on PB23 mux B */
#define MUX_PB23B_SERCOM5_PAD3             1
#define PINMUX_PB23B_SERCOM5_PAD3  ((PIN_PB23B_SERCOM5_PAD3 << 16) | MUX_PB23B_SERCOM5_PAD3)
#define PORT_PB23B_SERCOM5_PAD3    (1u << 23)
/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA00D_TC0_WO0                  0  /**< \brief TC0 signal: WO0 on PA00 mux D */
#define MUX_PA00D_TC0_WO0                  3
#define PINMUX_PA00D_TC0_WO0       ((PIN_PA00D_TC0_WO0 << 16) | MUX_PA00D_TC0_WO0)
#define PORT_PA00D_TC0_WO0         (1u <<  0)
#define PIN_PA08D_TC0_WO0                  8  /**< \brief TC0 signal: WO0 on PA08 mux D */
#define MUX_PA08D_TC0_WO0                  3
#define PINMUX_PA08D_TC0_WO0       ((PIN_PA08D_TC0_WO0 << 16) | MUX_PA08D_TC0_WO0)
#define PORT_PA08D_TC0_WO0         (1u <<  8)
#define PIN_PA01D_TC0_WO1                  1  /**< \brief TC0 signal: WO1 on PA01 mux D */
#define MUX_PA01D_TC0_WO1                  3
#define PINMUX_PA01D_TC0_WO1       ((PIN_PA01D_TC0_WO1 << 16) | MUX_PA01D_TC0_WO1)
#define PORT_PA01D_TC0_WO1         (1u <<  1)
#define PIN_PA09D_TC0_WO1                  9  /**< \brief TC0 signal: WO1 on PA09 mux D */
#define MUX_PA09D_TC0_WO1                  3
#define PINMUX_PA09D_TC0_WO1       ((PIN_PA09D_TC0_WO1 << 16) | MUX_PA09D_TC0_WO1)
#define PORT_PA09D_TC0_WO1         (1u <<  9)
/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA04D_TC1_WO0                  4  /**< \brief TC1 signal: WO0 on PA04 mux D */
#define MUX_PA04D_TC1_WO0                  3
#define PINMUX_PA04D_TC1_WO0       ((PIN_PA04D_TC1_WO0 << 16) | MUX_PA04D_TC1_WO0)
#define PORT_PA04D_TC1_WO0         (1u <<  4)
#define PIN_PA10D_TC1_WO0                 10  /**< \brief TC1 signal: WO0 on PA10 mux D */
#define MUX_PA10D_TC1_WO0                  3
#define PINMUX_PA10D_TC1_WO0       ((PIN_PA10D_TC1_WO0 << 16) | MUX_PA10D_TC1_WO0)
#define PORT_PA10D_TC1_WO0         (1u << 10)
#define PIN_PA30D_TC1_WO0                 30  /**< \brief TC1 signal: WO0 on PA30 mux D */
#define MUX_PA30D_TC1_WO0                  3
#define PINMUX_PA30D_TC1_WO0       ((PIN_PA30D_TC1_WO0 << 16) | MUX_PA30D_TC1_WO0)
#define PORT_PA30D_TC1_WO0         (1u << 30)
#define PIN_PA05D_TC1_WO1                  5  /**< \brief TC1 signal: WO1 on PA05 mux D */
#define MUX_PA05D_TC1_WO1                  3
#define PINMUX_PA05D_TC1_WO1       ((PIN_PA05D_TC1_WO1 << 16) | MUX_PA05D_TC1_WO1)
#define PORT_PA05D_TC1_WO1         (1u <<  5)
#define PIN_PA11D_TC1_WO1                 11  /**< \brief TC1 signal: WO1 on PA11 mux D */
#define MUX_PA11D_TC1_WO1                  3
#define PINMUX_PA11D_TC1_WO1       ((PIN_PA11D_TC1_WO1 << 16) | MUX_PA11D_TC1_WO1)
#define PORT_PA11D_TC1_WO1         (1u << 11)
#define PIN_PA31D_TC1_WO1                 31  /**< \brief TC1 signal: WO1 on PA31 mux D */
#define MUX_PA31D_TC1_WO1                  3
#define PINMUX_PA31D_TC1_WO1       ((PIN_PA31D_TC1_WO1 << 16) | MUX_PA31D_TC1_WO1)
#define PORT_PA31D_TC1_WO1         (1u << 31)
/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PA16D_TC2_WO0                 16  /**< \brief TC2 signal: WO0 on PA16 mux D */
#define MUX_PA16D_TC2_WO0                  3
#define PINMUX_PA16D_TC2_WO0       ((PIN_PA16D_TC2_WO0 << 16) | MUX_PA16D_TC2_WO0)
#define PORT_PA16D_TC2_WO0         (1u << 16)
#define PIN_PA12D_TC2_WO0                 12  /**< \brief TC2 signal: WO0 on PA12 mux D */
#define MUX_PA12D_TC2_WO0                  3
#define PINMUX_PA12D_TC2_WO0       ((PIN_PA12D_TC2_WO0 << 16) | MUX_PA12D_TC2_WO0)
#define PORT_PA12D_TC2_WO0         (1u << 12)
#define PIN_PA17D_TC2_WO1                 17  /**< \brief TC2 signal: WO1 on PA17 mux D */
#define MUX_PA17D_TC2_WO1                  3
#define PINMUX_PA17D_TC2_WO1       ((PIN_PA17D_TC2_WO1 << 16) | MUX_PA17D_TC2_WO1)
#define PORT_PA17D_TC2_WO1         (1u << 17)
#define PIN_PA13D_TC2_WO1                 13  /**< \brief TC2 signal: WO1 on PA13 mux D */
#define MUX_PA13D_TC2_WO1                  3
#define PINMUX_PA13D_TC2_WO1       ((PIN_PA13D_TC2_WO1 << 16) | MUX_PA13D_TC2_WO1)
#define PORT_PA13D_TC2_WO1         (1u << 13)
/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA14D_TC3_WO0                 14  /**< \brief TC3 signal: WO0 on PA14 mux D */
#define MUX_PA14D_TC3_WO0                  3
#define PINMUX_PA14D_TC3_WO0       ((PIN_PA14D_TC3_WO0 << 16) | MUX_PA14D_TC3_WO0)
#define PORT_PA14D_TC3_WO0         (1u << 14)
#define PIN_PA18D_TC3_WO0                 18  /**< \brief TC3 signal: WO0 on PA18 mux D */
#define MUX_PA18D_TC3_WO0                  3
#define PINMUX_PA18D_TC3_WO0       ((PIN_PA18D_TC3_WO0 << 16) | MUX_PA18D_TC3_WO0)
#define PORT_PA18D_TC3_WO0         (1u << 18)
#define PIN_PA15D_TC3_WO1                 15  /**< \brief TC3 signal: WO1 on PA15 mux D */
#define MUX_PA15D_TC3_WO1                  3
#define PINMUX_PA15D_TC3_WO1       ((PIN_PA15D_TC3_WO1 << 16) | MUX_PA15D_TC3_WO1)
#define PORT_PA15D_TC3_WO1         (1u << 15)
#define PIN_PA19D_TC3_WO1                 19  /**< \brief TC3 signal: WO1 on PA19 mux D */
#define MUX_PA19D_TC3_WO1                  3
#define PINMUX_PA19D_TC3_WO1       ((PIN_PA19D_TC3_WO1 << 16) | MUX_PA19D_TC3_WO1)
#define PORT_PA19D_TC3_WO1         (1u << 19)
/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PB08D_TC4_WO0                 40  /**< \brief TC4 signal: WO0 on PB08 mux D */
#define MUX_PB08D_TC4_WO0                  3
#define PINMUX_PB08D_TC4_WO0       ((PIN_PB08D_TC4_WO0 << 16) | MUX_PB08D_TC4_WO0)
#define PORT_PB08D_TC4_WO0         (1u <<  8)
#define PIN_PA24D_TC4_WO0                 24  /**< \brief TC4 signal: WO0 on PA24 mux D */
#define MUX_PA24D_TC4_WO0                  3
#define PINMUX_PA24D_TC4_WO0       ((PIN_PA24D_TC4_WO0 << 16) | MUX_PA24D_TC4_WO0)
#define PORT_PA24D_TC4_WO0         (1u << 24)
#define PIN_PB09D_TC4_WO1                 41  /**< \brief TC4 signal: WO1 on PB09 mux D */
#define MUX_PB09D_TC4_WO1                  3
#define PINMUX_PB09D_TC4_WO1       ((PIN_PB09D_TC4_WO1 << 16) | MUX_PB09D_TC4_WO1)
#define PORT_PB09D_TC4_WO1         (1u <<  9)
#define PIN_PA25D_TC4_WO1                 25  /**< \brief TC4 signal: WO1 on PA25 mux D */
#define MUX_PA25D_TC4_WO1                  3
#define PINMUX_PA25D_TC4_WO1       ((PIN_PA25D_TC4_WO1 << 16) | MUX_PA25D_TC4_WO1)
#define PORT_PA25D_TC4_WO1         (1u << 25)
/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PA26D_TC5_WO0                 26  /**< \brief TC5 signal: WO0 on PA26 mux D */
#define MUX_PA26D_TC5_WO0                  3
#define PINMUX_PA26D_TC5_WO0       ((PIN_PA26D_TC5_WO0 << 16) | MUX_PA26D_TC5_WO0)
#define PORT_PA26D_TC5_WO0         (1u << 26)
#define PIN_PB00D_TC5_WO0                 32  /**< \brief TC5 signal: WO0 on PB00 mux D */
#define MUX_PB00D_TC5_WO0                  3
#define PINMUX_PB00D_TC5_WO0       ((PIN_PB00D_TC5_WO0 << 16) | MUX_PB00D_TC5_WO0)
#define PORT_PB00D_TC5_WO0         (1u <<  0)
#define PIN_PA27D_TC5_WO1                 27  /**< \brief TC5 signal: WO1 on PA27 mux D */
#define MUX_PA27D_TC5_WO1                  3
#define PINMUX_PA27D_TC5_WO1       ((PIN_PA27D_TC5_WO1 << 16) | MUX_PA27D_TC5_WO1)
#define PORT_PA27D_TC5_WO1         (1u << 27)
#define PIN_PB01D_TC5_WO1                 33  /**< \brief TC5 signal: WO1 on PB01 mux D */
#define MUX_PB01D_TC5_WO1                  3
#define PINMUX_PB01D_TC5_WO1       ((PIN_PB01D_TC5_WO1 << 16) | MUX_PB01D_TC5_WO1)
#define PORT_PB01D_TC5_WO1         (1u <<  1)
/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PB20D_TC6_WO0                 52  /**< \brief TC6 signal: WO0 on PB20 mux D */
#define MUX_PB20D_TC6_WO0                  3
#define PINMUX_PB20D_TC6_WO0       ((PIN_PB20D_TC6_WO0 << 16) | MUX_PB20D_TC6_WO0)
#define PORT_PB20D_TC6_WO0         (1u << 20)
#define PIN_PB21D_TC6_WO1                 53  /**< \brief TC6 signal: WO1 on PB21 mux D */
#define MUX_PB21D_TC6_WO1                  3
#define PINMUX_PB21D_TC6_WO1       ((PIN_PB21D_TC6_WO1 << 16) | MUX_PB21D_TC6_WO1)
#define PORT_PB21D_TC6_WO1         (1u << 21)
/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PB22D_TC7_WO0                 54  /**< \brief TC7 signal: WO0 on PB22 mux D */
#define MUX_PB22D_TC7_WO0                  3
#define PINMUX_PB22D_TC7_WO0       ((PIN_PB22D_TC7_WO0 << 16) | MUX_PB22D_TC7_WO0)
#define PORT_PB22D_TC7_WO0         (1u << 22)
#define PIN_PB23D_TC7_WO1                 55  /**< \brief TC7 signal: WO1 on PB23 mux D */
#define MUX_PB23D_TC7_WO1                  3
#define PINMUX_PB23D_TC7_WO1       ((PIN_PB23D_TC7_WO1 << 16) | MUX_PB23D_TC7_WO1)
#define PORT_PB23D_TC7_WO1         (1u << 23)
/* ========== PORT definition for ADC peripheral ========== */
#define PIN_PA00H_ADC_AIN0                 0  /**< \brief ADC signal: AIN0 on PA00 mux H */
#define MUX_PA00H_ADC_AIN0                 7
#define PINMUX_PA00H_ADC_AIN0      ((PIN_PA00H_ADC_AIN0 << 16) | MUX_PA00H_ADC_AIN0)
#define PORT_PA00H_ADC_AIN0        (1u <<  0)
#define PIN_PA01H_ADC_AIN1                 1  /**< \brief ADC signal: AIN1 on PA01 mux H */
#define MUX_PA01H_ADC_AIN1                 7
#define PINMUX_PA01H_ADC_AIN1      ((PIN_PA01H_ADC_AIN1 << 16) | MUX_PA01H_ADC_AIN1)
#define PORT_PA01H_ADC_AIN1        (1u <<  1)
#define PIN_PA02H_ADC_AIN2                 2  /**< \brief ADC signal: AIN2 on PA02 mux H */
#define MUX_PA02H_ADC_AIN2                 7
#define PINMUX_PA02H_ADC_AIN2      ((PIN_PA02H_ADC_AIN2 << 16) | MUX_PA02H_ADC_AIN2)
#define PORT_PA02H_ADC_AIN2        (1u <<  2)
#define PIN_PA03H_ADC_AIN3                 3  /**< \brief ADC signal: AIN3 on PA03 mux H */
#define MUX_PA03H_ADC_AIN3                 7
#define PINMUX_PA03H_ADC_AIN3      ((PIN_PA03H_ADC_AIN3 << 16) | MUX_PA03H_ADC_AIN3)
#define PORT_PA03H_ADC_AIN3        (1u <<  3)
#define PIN_PA04H_ADC_AIN4                 4  /**< \brief ADC signal: AIN4 on PA04 mux H */
#define MUX_PA04H_ADC_AIN4                 7
#define PINMUX_PA04H_ADC_AIN4      ((PIN_PA04H_ADC_AIN4 << 16) | MUX_PA04H_ADC_AIN4)
#define PORT_PA04H_ADC_AIN4        (1u <<  4)
#define PIN_PA05H_ADC_AIN5                 5  /**< \brief ADC signal: AIN5 on PA05 mux H */
#define MUX_PA05H_ADC_AIN5                 7
#define PINMUX_PA05H_ADC_AIN5      ((PIN_PA05H_ADC_AIN5 << 16) | MUX_PA05H_ADC_AIN5)
#define PORT_PA05H_ADC_AIN5        (1u <<  5)
#define PIN_PA06H_ADC_AIN6                 6  /**< \brief ADC signal: AIN6 on PA06 mux H */
#define MUX_PA06H_ADC_AIN6                 7
#define PINMUX_PA06H_ADC_AIN6      ((PIN_PA06H_ADC_AIN6 << 16) | MUX_PA06H_ADC_AIN6)
#define PORT_PA06H_ADC_AIN6        (1u <<  6)
#define PIN_PA07H_ADC_AIN7                 7  /**< \brief ADC signal: AIN7 on PA07 mux H */
#define MUX_PA07H_ADC_AIN7                 7
#define PINMUX_PA07H_ADC_AIN7      ((PIN_PA07H_ADC_AIN7 << 16) | MUX_PA07H_ADC_AIN7)
#define PORT_PA07H_ADC_AIN7        (1u <<  7)
#define PIN_PB00H_ADC_AIN8                32  /**< \brief ADC signal: AIN8 on PB00 mux H */
