zhengwang721/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20g17a.h
#define MUX_PB00H_ADC_AIN8                 7
#define PINMUX_PB00H_ADC_AIN8      ((PIN_PB00H_ADC_AIN8 << 16) | MUX_PB00H_ADC_AIN8)
#define PORT_PB00H_ADC_AIN8        (1u <<  0)
#define PIN_PB01H_ADC_AIN9                33  /**< \brief ADC signal: AIN9 on PB01 mux H */
#define MUX_PB01H_ADC_AIN9                 7
#define PINMUX_PB01H_ADC_AIN9      ((PIN_PB01H_ADC_AIN9 << 16) | MUX_PB01H_ADC_AIN9)
#define PORT_PB01H_ADC_AIN9        (1u <<  1)
#define PIN_PB02H_ADC_AIN10               34  /**< \brief ADC signal: AIN10 on PB02 mux H */
#define MUX_PB02H_ADC_AIN10                7
#define PINMUX_PB02H_ADC_AIN10     ((PIN_PB02H_ADC_AIN10 << 16) | MUX_PB02H_ADC_AIN10)
#define PORT_PB02H_ADC_AIN10       (1u <<  2)
#define PIN_PB03H_ADC_AIN11               35  /**< \brief ADC signal: AIN11 on PB03 mux H */
#define MUX_PB03H_ADC_AIN11                7
#define PINMUX_PB03H_ADC_AIN11     ((PIN_PB03H_ADC_AIN11 << 16) | MUX_PB03H_ADC_AIN11)
#define PORT_PB03H_ADC_AIN11       (1u <<  3)
#define PIN_PA02H_ADC_VREFP                2  /**< \brief ADC signal: VREFP on PA02 mux H */
#define MUX_PA02H_ADC_VREFP                7
#define PINMUX_PA02H_ADC_VREFP     ((PIN_PA02H_ADC_VREFP << 16) | MUX_PA02H_ADC_VREFP)
#define PORT_PA02H_ADC_VREFP       (1u <<  2)
/* ========== PORT definition for AC peripheral ========== */
#define PIN_PA04H_AC_AIN0                  4  /**< \brief AC signal: AIN0 on PA04 mux H */
#define MUX_PA04H_AC_AIN0                  7
#define PINMUX_PA04H_AC_AIN0       ((PIN_PA04H_AC_AIN0 << 16) | MUX_PA04H_AC_AIN0)
#define PORT_PA04H_AC_AIN0         (1u <<  4)
#define PIN_PA05H_AC_AIN1                  5  /**< \brief AC signal: AIN1 on PA05 mux H */
#define MUX_PA05H_AC_AIN1                  7
#define PINMUX_PA05H_AC_AIN1       ((PIN_PA05H_AC_AIN1 << 16) | MUX_PA05H_AC_AIN1)
#define PORT_PA05H_AC_AIN1         (1u <<  5)
#define PIN_PA06H_AC_AIN2                  6  /**< \brief AC signal: AIN2 on PA06 mux H */
#define MUX_PA06H_AC_AIN2                  7
#define PINMUX_PA06H_AC_AIN2       ((PIN_PA06H_AC_AIN2 << 16) | MUX_PA06H_AC_AIN2)
#define PORT_PA06H_AC_AIN2         (1u <<  6)
#define PIN_PA07H_AC_AIN3                  7  /**< \brief AC signal: AIN3 on PA07 mux H */
#define MUX_PA07H_AC_AIN3                  7
#define PINMUX_PA07H_AC_AIN3       ((PIN_PA07H_AC_AIN3 << 16) | MUX_PA07H_AC_AIN3)
#define PORT_PA07H_AC_AIN3         (1u <<  7)
#define PIN_PA10G_AC_CMP0                 10  /**< \brief AC signal: CMP0 on PA10 mux G */
#define MUX_PA10G_AC_CMP0                  6
#define PINMUX_PA10G_AC_CMP0       ((PIN_PA10G_AC_CMP0 << 16) | MUX_PA10G_AC_CMP0)
#define PORT_PA10G_AC_CMP0         (1u << 10)
#define PIN_PA12G_AC_CMP0                 12  /**< \brief AC signal: CMP0 on PA12 mux G */
#define MUX_PA12G_AC_CMP0                  6
#define PINMUX_PA12G_AC_CMP0       ((PIN_PA12G_AC_CMP0 << 16) | MUX_PA12G_AC_CMP0)
#define PORT_PA12G_AC_CMP0         (1u << 12)
#define PIN_PA11G_AC_CMP1                 11  /**< \brief AC signal: CMP1 on PA11 mux G */
#define MUX_PA11G_AC_CMP1                  6
#define PINMUX_PA11G_AC_CMP1       ((PIN_PA11G_AC_CMP1 << 16) | MUX_PA11G_AC_CMP1)
#define PORT_PA11G_AC_CMP1         (1u << 11)
#define PIN_PA13G_AC_CMP1                 13  /**< \brief AC signal: CMP1 on PA13 mux G */
#define MUX_PA13G_AC_CMP1                  6
#define PINMUX_PA13G_AC_CMP1       ((PIN_PA13G_AC_CMP1 << 16) | MUX_PA13G_AC_CMP1)
#define PORT_PA13G_AC_CMP1         (1u << 13)
/* ========== PORT definition for DAC peripheral ========== */
#define PIN_PA00H_DAC_VOUT                 0  /**< \brief DAC signal: VOUT on PA00 mux H */
#define MUX_PA00H_DAC_VOUT                 7
#define PINMUX_PA00H_DAC_VOUT      ((PIN_PA00H_DAC_VOUT << 16) | MUX_PA00H_DAC_VOUT)
#define PORT_PA00H_DAC_VOUT        (1u <<  0)
#define PIN_PA01H_DAC_VREFP                1  /**< \brief DAC signal: VREFP on PA01 mux H */
#define MUX_PA01H_DAC_VREFP                7
#define PINMUX_PA01H_DAC_VREFP     ((PIN_PA01H_DAC_VREFP << 16) | MUX_PA01H_DAC_VREFP)
#define PORT_PA01H_DAC_VREFP       (1u <<  1)

#endif /* _SAMD20G17A_PIO_ */
